Revit 2024 API
DuctSizes.GetDuctSizeIterator Method
Returns a DuctSizeIterator that iterates through the collection.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public DuctSizeIterator GetDuctSizeIterator()
Visual Basic
Public Function GetDuctSizeIterator As DuctSizeIterator
Visual C++
public:
DuctSizeIterator^ GetDuctSizeIterator()
Return Value
A DuctSizeIterator object that can be used to iterate through key-value pairs in the collection.
See Also
DuctSizes Class
Autodesk.Revit.DB.Mechanical Namespace